<?php
return [
    'publish_date' => 'Дата публикации',
    'form' => 'Форма',
    'add' => 'Добавить',
    'add_post' => '🔖 Добавить пост',
    'greeting' => 'Здравствуйте! Используйте кнопку для публикации поста!',
    'create' => 'Создать',
    'trusted_author' => 'Доверенный автор',
    'user' => 'Пользователь',
    'title' => 'Название',
    'message' => 'сообщение',
    'has_posted' => 'размещено',
    'message_accepted' => 'Сообщение принято',
    'code' => 'Код',
    'api_token' => 'API токен',
    'moderation_group' => 'Группа модерации',
    'webapp_form' => 'WebApp форма',
    'description' => 'Описание',
    'actions' => 'Действия',
    'message_text' => 'Текст сообщения',
    'delete' => 'Удалить',
    'update' => 'Обновить',
    'files' => 'Файлы',
    'status' => 'Статус',
    'wait' => 'Ожидание',
    'success' => 'Успех',
    'error' => 'Ошибка',
    'channels' => 'Каналы',
    'bots' => [
        'list' => 'Список ботов Телеграм',
        'add' => 'Добавить бота Телеграм',
        'edit' => 'Редактировать бота Телеграм'
    ],
    'messages' => [
        'edit' => 'Редактировать сообщение от :author',
        'schedule' => 'Расписание отправки',
        'scheduled_dispatch_time' => 'План публикации',
        'real_dispatch_time' => 'Реальное время публикации',

    ]
];