<?php

namespace App\Http\Controllers;

use App\Models\Channel;
use App\Models\Place;
use Illuminate\Http\Request;

class TestController extends Controller
{
    public function __invoke()
    {
        if(!auth()->user() || auth()->user()->hasRole('superadmin')) return redirect('/');
//
//        $arr = Channel::query()->whereIn('telegram_bot_id', [4,5])->get();
//        foreach ($arr as $ch) {
//            $name = str_replace([' (ВК)', ' (ТГ)'], '', $ch->name);
//            $places = Place::query()->where('name', $name)->where('telegram_bot_id', $ch->telegram_bot_id)->get();
//            foreach ($places as $place) {
//                dump($place);
//                dd($ch);
////                $place->channels()->attach($ch);
//            }
//
//        }
//        dd('end');




//        $TECHNIKAL_CHANEL = [
//            'ДК «Фортуна»' => [
//                'vk' =>
//                    [
//                        1225777
//                    ],
//                'tlg' =>
//                    [
//                        -1001708739266
//                    ]
//            ],
//            'ДК «Полёт»' => [
//                'vk' =>
//                    [
//                        147973405
//                    ],
//                'tlg' =>
//                    [
//                        -1001633873259
//                    ]
//            ],
//            'ДК «Меридиан»' => [
//                'vk' =>
//                    [
//                        26840543
//                    ],
//                'tlg' =>
//                    [
//                        -1001552664855
//                    ]
//            ],
//            'ДК «Русь»' => [
//                'vk' =>
//                    [
//                        113759366
//                    ],
//                'tlg' =>
//                    [
//                        -1001700152084
//                    ]
//            ],
//            'ДК «Современник»' => [
//                'vk' =>
//                    [
//                        145914004
//                    ],
//                'tlg' =>
//                    [
//                        -1001632690430
//                    ]
//            ],
//            'ДК «Родник»' => [
//                'vk' =>
//                    [
//                        134925997
//                    ],
//                'tlg' =>
//                    [
//                        -1001713588972
//                    ]
//            ],
//            'ДК «Орбита»' => [
//                'vk' =>
//                    [
//                        47979295
//                    ],
//                'tlg' =>
//                    [
//                        -1001501043319
//                    ]
//            ],
//            'ДК «Заря»' => [
//                'vk' =>
//                    [
//                        146370377
//                    ],
//                'tlg' =>
//                    [
//                        -1001690999054
//                    ]
//            ],
//            'ДК «Энергия»' => [
//                'vk' =>
//                    [
//                        185588018
//                    ],
//                'tlg' =>
//                    [
//                        -1001645198562
//                    ]
//            ],
//            'ДК «Луч»' => [
//                'vk' =>
//                    [
//                        112164928
//                    ],
//                'tlg' =>
//                    [
//                        -1001844185964
//                    ]
//            ],
//            'ДК «Дружба»' => [
//                'vk' =>
//                    [
//                        39479752
//                    ],
//                'tlg' =>
//                    [
//                        -1001800330862,-1001636338582,-1001713588972,-1001569333406,-1001249602579,-1001844185964
//                    ]
//            ],
//            'ДК «Собеседник»' => [
//                'vk' =>
//                    [
//                        139001884
//                    ],
//                'tlg' =>
//                    [
//                        -1001638892993
//                    ]
//            ],
//            'ДК «Радуга»' => [
//                'vk' =>
//                    [
//                        80318331
//                    ],
//                'tlg' =>
//                    [
//                        -1001249602579
//                    ]
//            ],
//            'ДК «Мечта»' => [
//                'vk' =>
//                    [
//                        135173787
//                    ],
//                'tlg' =>
//                    [
//                        -1001569333406
//                    ]
//            ],
//            'ДК «Каскад»' => [
//                'vk' =>
//                    [
//                        211630683
//                    ],
//                'tlg' =>
//                    [
//                        -1001636338582
//                    ]
//            ],
//            'ДК «Ровесник»' => [
//                'vk' =>
//                    [
//                        190151550
//                    ],
//                'tlg' =>
//                    [
//                        -1001602196104
//                    ]
//            ],
//            'Культурно-творческая дирекция г.о. Чехов' => [
//                'vk' =>
//                    [
//                        200244736
//                    ],
//                'tlg' =>
//                    [
//                        -1001337872254
//                    ]
//            ],
//            'Дубненская сельская библиотека' => [
//                'tlg' =>
//                    [
//                        -1001569333406
//                    ]
//            ],
//            'Васькинская сельская библиотека' => [
//                'tlg' =>
//                    [
//                        -1001636338582
//                    ]
//            ],
//            'Шараповская сельская библиотека' => [
//                'tlg' =>
//                    [
//                        -1001713588972
//                    ]
//            ],
//            'Молодинская сельская библиотека' => [
//                'tlg' =>
//                    [
//                        -1001249602579
//                    ]
//            ],
//            'Стремиловская сельская библиотека' => [
//                'tlg' =>
//                    [
//                        -1001844185964
//                    ]
//            ]
//        ];
//
//        foreach ($TECHNIKAL_CHANEL as $name => $arr) {
//            foreach ($arr as $t => $values) {
//                $type = $t == 'vk' ? 'vk' : 'tg';
//                $postfix = $t == 'vk' ? 'ВК' : 'ТГ';
//                foreach ($values as $value) {
//                    $exist_ch = Channel::query()->where('name', "$name ($postfix)")->first();
//                    if(!$exist_ch) {
//                        Channel::create([
//                            'tg_id' => $value,
//                            'telegram_bot_id' => 4,
//                            'name' => "$name ($postfix)",
//                            'type' => $type,
//                        ]);
//                        Channel::create([
//                            'tg_id' => $value,
//                            'telegram_bot_id' => 5,
//                            'name' => "$name ($postfix)",
//                            'type' => $type
//                        ]);
//                    }
//                }
//            }
//        }
        return redirect('/');
    }
}
